package Polyclinic;

public class Polyclinic {
    //Задание 5
    //Создать программу на языке Java для определения класса в некоторой предметной области.
    //Описать свойства, конструктор, методы геттеры/сеттеры, перекрыть метод toString() для вывода
    //полной информации об объекте в отформатированном виде:
    //к - Конструктор

    //13). Медицинское обслуживание
    //
    //Polyclinic:
    //Свойства:
    //название поликлиники; к
    //адрес поликлиники; к
    //фамилия пациента; к
    //номер полиса; к
    //дата осмотра; к
    //фамилия врача;
    //должность врача;
    //диагноз;
}
